Revit 2024 API
View.Print Method
Print this view.
Overload List
Name | Description
Print()
Print this view with the default view template and using the print setting of the current active document.
Print(Boolean)
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
Print(View)
Print this view with the given view template and using the print setting of the current active document.
Print(View, Boolean)
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
See Also
View Class
View Members
Autodesk.Revit.DB Namespace